
; 本文是 WimTool - V2.0.2026.0103版文本資源，必須是Unicode(UTF-16LE)編碼格式；
; 支持以";"或"//"為行首整行注釋和行后注釋，不支持段落注釋；
; "[ ]"內的內容為 INI 配置文件的節名，其中的字符不要修改，各個節的順序不能改變。

; 01、配置文件定義的文件目錄路徑，前導符(第1個字符)一定要是'\'或'*'；
; 02、以'\'為前導符表示的是相對于根的絕對路徑，根的解釋看第10、11點；
; 03、以'*'為前導符表示的是相對路徑，相對于根的任何目錄，可能匹配多次；
; 04、'?'匹配任何1個字符，但與'\'和'.'不匹配，也與字符串不匹配；
; 05、'*'匹配字符串，但與'\'和'.'不匹配，即匹配任何無擴展名的文件目錄；
; 06、"*.*"匹配有任意擴展名的任意文件目錄(但與無擴展名的不匹配)；
; 07、多級目錄可帶通配符'*'和'?'，如"\Win????\SYSTEM*\*.EXE"；
; 08、如果是確定的文件目錄，盡量不要使用通配符，如"\PageFile.SYS"；
; 09、文件目錄名忽略大小寫，即不區分大小寫，如"C:\"同"c:\"；
; 10、根與DOS定義類似，如捕獲"D:\Tool"目錄，則根為"D:\Tool"；
; 11、如向"D:\MyTools"解開一個WIM映像，則根為"D:\MyTools"。

[ExclusionList]			//設置被排除的文件目錄，這些文件目錄不會被捕獲或解壓。
				//此節的文件目錄可自行增減
\$NTFS.LOG
\$Recycle.Bin
\$Windows.~bt
\$Windows.~ls
\Hiberfil.SYS				//休眠文件
\PageFile.SYS				//虛擬內存
\Recycled				//回收站目錄
\Recycler				//回收站目錄
*\Temp					//臨時文件目錄
*\Tmp					//臨時文件目錄
\Windows\CSC				//脫機文件緩存目錄
\System Volume Information		//系統卷標信息目錄


//在備份系統時(根是C:)，以下5行作為范例已被注釋掉
;\Windows\Temp\*			//這樣可表示某目錄下的所有文件
;\Windows\System32\Config\*.LOG*	//注冊表目錄的殘余垃圾
;\Windows\System32\Config\*.BLF		//注冊表目錄的殘余垃圾(用這方法可表示某目錄下的某類文件)
;\Windows\System32\Config\*.*		//注冊表目錄的殘余垃圾(也可這樣表示，因為這樣寫就與無擴展名的不匹配)

[ExclusionException]			//設置例外列表，表中的文件目錄將會無條件地被捕獲或解壓。
					//此規則的設定是為排除一類文件時又要保留其中若干個而設置。

[CompressionExclusionList]		//設置已壓縮的文件不再壓縮，以加快捕獲速度。
					//此節的文件可自行增減
					//排除以下類型的文件在壓縮序列，這些文件在WIM映像內不會被壓縮。
*.7Z
*.BZ2
*.CAB
*.GZ
*.MP3
*.PNF
*.RAR
*.TAR
*.WIM
*.ZIP

[AlignmentList]				//設置文件在64K邊界對齊，在64K邊界對齊的任何文件，將不會被壓縮，
					//通常情況下此規則沒有什么意義，本人也從來沒有設置和應用此規則。


[System_Flag]				//映像標志列表，在進行語言本地化時，可自行修改、補充、刪除。
可下拉選擇也可填寫
Education Edition
Embedded Edition
Enterprise Edition
Enterprise LTSB
Enterprise LTSC
Home Basic Edition
Home Edition
IoT Core Edition
IoT Enterprise
IoT Enterprise LTSC
Mobile Edition
Mobile Enterprise
Premium Edition
Professional Edition
Standard Edition
Starter Edition
Ultimate Edition

[Compress_Type]			//壓縮類型列表，語言本地化時，此節內容只可翻譯，不可修改或刪除。
沒有壓縮(NONE)
默認壓縮(XPRESS)
最大壓縮(LZX)
極限壓縮(LZMS)

[Help_Text1]
                    本頁有四部分功能
1、刷新列表
   在表中加入其它工具掛載的映像或移除其它工具卸載的映像，操作無選項。

2、掛載映像
   必選項有映像文件名、目標目錄、映像號，可改寫掛載是可選項。
3、卸載映像
   必選項是掛載映像的目標目錄，[執行卸載處理命令]為可選項。通過單擊[卸載映像]按鈕或雙擊列表中的掛載的卷號卸載可寫方式掛載映像時，WimTool會提示。雙擊表頭將以不修改方卸載全部映像，雙擊列表中的文件也以不修改方式卸載映像。WimTool不能掛載或卸載分包文件。
4、解開映像
   必選項與1的相同，無可選項。本工具能解開分割包文件，所有的分包文件必須位于同一目錄，且名稱要與 ImageX 分割WIM映像生成分包文件的命名規則匹配。

[Help_Text2]
                                       本頁有三部分功能

1、定義映像配置文件
   在這個配置文件里，制作映像時，你可以定義那些文件或目錄不被捕獲到WIM映像內，那些文件在WIM映像內不被再次壓縮，那些文件在64K邊界對齊；在解開映像時，你也可以定義那些文件被解壓出來，那些文件不被解壓出來。這個配置文件的定義與ImageX的兼容，你可以使用你的ImageX的配置文件。
2、制作新的映像文件
   必選項有要制作Wim映像的源目錄和保存映像的文件名，可選項是壓縮類型、映像名稱、映像說明和啟動標記。
3、向映像中加入新映卷
   必選項與第1部分相同，可選項是映像名稱、映像說明和啟動標記。當保存的映像文件存在時，WimTool會自動選擇與原映像匹配的壓縮類型，并自動選上追加方式。不支持向分割包文件中追加新的映像卷。如果你對映像配置文件不是很了解，請不要修改它，用默認的設置即可。
4、強烈建議填寫的選項
   不管是新建映像還是追加映卷，強烈建議填寫映像名稱和映像標志這兩個選項，以便調識別映像內容。

[Help_Text3]
                本頁有三部分功能

1、導出合并
   將Wim文件存在的映像卷導出成一個新的Wim映像或導入到另一Wim文件中，必選項有源文件名、源文件中的映像號和目標文件名。當從WIM映像中導出一個卷作為全新的WIM映像時，目標映像的壓縮類型為可選項。利用導出功能，可將一組分割包合并為一個Wim映像文件；利用導出功能可對WIM映像文件進行優化。
2、分割映像
   必選項有被分割的Wim文件、分割后保存的文件和分包大小，沒有可選項。將一個映卷導出為全新映像時，如果改變它的壓縮類型可能會使操作變慢；向一個映像導入一個映卷時，壓縮類型由目標映像決定；分割 WIM 文件時，分包文件建議不要用數字作基本名。已分割的 WIM 文件不支持再被分割，也不支持向分割包文件導入映像卷。
3、優化轉換
   也可實現壓縮類型的轉換和文件優化，必選項是WIM源文件；如果目標文件名存在時，則將源文件優化或轉換到目標文件，否則就源文件進行優化或轉換。
4、注意事項
   極限壓縮(LZMS)即為ESD壓縮，這種壓縮類型的文件擴展名可以互換，可通過導出合并功能來實現壓縮類型的轉換，包括WIM與ESD的互換。利用導出功能進行的壓縮類型轉換得到的文件更小，但轉換操作時間會更長。

[Help_Text4]
          本頁有三部分功能

1、刪除映像分卷
   從含多個映卷的Wim文件中刪除指定映像卷，必選項是Wim映像文件名和映像卷號，沒有可選項。不能刪除分割包中的映像卷。刪除 Wim 文件中的映像卷僅刪除元數據及相關條目，并不能減小Wim文件的體積。
2、查看映像信息
   查看Wim映像信息，必選項是文件名，無可選項，可從列表中選擇相應的映像卷。
3、修改映像信息
   必選項是文件名，可從列表中選擇相應的映像卷，修改其相應的映像信息。

[Help_Text5]
                             外殼執行擴展設置說明

1、目標掛載目錄: 是指定雙擊該WIM映像后掛載的目錄，該目錄不設置時，會自動掛載下WimTool設置的"自動掛載基礎目錄"下；用WimMount.SYS驅動時，這些目錄必須是 NTFS 分區中的空目錄。
2、掛載完成執行: 是指掛載后要執行WIM內的命令，以下稱"掛載命令"。
3、卸載之前執行: 是指卸載之前要執行的命令，以下稱"卸載命令"。"掛載命令"、"卸載命令"目前只支持Windows系統的.EXE文件(可帶參數)，
4、結束自動卸載: 是指"掛載命令"執行完成后自動卸載WIM，并執行"卸載命令"和"刪除卸載目錄"等操作。
5、外殼執行擴展中支持以下環境變量：
   %MountDir%: 表示Wim映像的掛載目錄
   %AppPath%:  表示WimTool所在的目錄
   %WimFile%:  表示掛載的Wim映像文件

[Help_Text6]
         本頁有四部分功能

1、設置映像擴展圖標
   必選項映像文件名、圖標資源文件名和圖標，圖標大小是可選項。用 WimTool注冊[圖標擴展功能]才能看到顯示效果。性能差的機子不要寫入64*64以上大圖標。
2、刪除映像擴展圖標
   必選項映像文件名，無可選項。
3、重建系統圖標緩存
   當WIM擴展圖標顯示失效或系統圖標顯示出錯時，重建圖標緩存可使圖標顯示正常，重建圖標緩存時可能會使資源管器視圖中的圖標作重新排列。
4、提取文件中的圖標
   必選項是EXE、DLL、CPL等含有圖標的資源文件，選擇資源中的某個圖標，將其保存為圖標ICO文件。

[Help_Text7]
                           本頁有六部分功能

1、設置文件關聯
   用于設置雙擊WIM文件時可通過WimTool掛載WIM映像，并執行WIM映像內設置好的掛載處理命令。如果該WIM映像沒有設置掛載處理命令，則打開掛載目錄。
2、取消文件關聯
   用于取消WIM映像文件與WimTool的文件關聯設置。當系統中的WIM文件關聯出現錯誤或異常時，可以先點[取消文件關聯]，再點[設置文件關聯]來修復。
3、注冊擴展功能
   擴展功能有三部分：一是右鍵擴展菜單，通過右鍵菜單可以對WIM文件、文件夾用WimTool進行快速處理，如掛載WIM文件、將文件夾壓制成WIM映像以及對掛載目錄、WIM映像進行卸載等；二是外殼圖標擴展，每個WIM文件都可以設置自己的特色圖標，如同不同的 EXE文件有不同的圖標一樣；三是外殼執行擴展，即文件關聯功能。這三部分功能可單獨注冊，互不影響。
4、卸載擴展功能
   包括卸載[右鍵擴展菜單]、[外殼圖標擴展]和[外殼執行擴展]，這三部分功能可單獨卸載，互不影響。
5、設置默認參數
   恢復WimTool初始時各參數、自動掛載基礎路徑和WIM臨時工作目錄的默認設置。
6、保存應用設置
   保存WimTool各參數、自動掛載基礎路徑和WIM臨時工作目錄的設置，這些設置會關聯第一頁的參數設置。
   一個WIM映像沒有設置好掛載目錄時會自動掛載到"自動掛載基礎路徑"的子目錄下；WIM臨時工作目錄建議設置到硬盤自由空間充足的位置，這一目錄的設置不會影響系統的臨時目錄。

[Help_Text8]
             擴展功能說明 
1、擴展功能并非 WIMGAPI.DLL 的功能，三項功能可單獨注冊，互不影響；
2、注冊外殼圖標擴展后可能一些機子的資源管理器不穩定，可以卸載它。

[String_List]			//字符資源列表，語言本地化時，此節內容只可翻譯，不可修改或刪除。
0=掛載和解開
1=新制和追加
2=導出和分割
3=刪卷和信息
4=瀏覽和提取
5=外殼執行頁
6=外殼圖標頁
7=注冊及設置
8=說明和聲明
9=WimTool - 編輯配置文件
10=執行展開映像任務...
11=打開映像文件...
12=注冊回調消息...
13=設置臨時目錄...
14=加載映像分卷...
15=開始展開映像...
16=關閉映像分卷...
17=卸載回調消息...
18=關閉映像文件...
19=展開映像文件...
20=用戶終止了操作！
21=完成
22=失敗
23=是
24=否
25=掛載映像文件...
26=找不到列表中掛載的映像路徑，
27=可能該掛載路徑已被其它工具卸載。
28=選擇卸載WIM映像的方式
29=你所卸載的WIM映像是以可寫方式掛載的，
30=卸載時是否將修改結果更新到原WIM文件中？
31=要更新選擇[是]，不更新選擇[否]，放棄操作選擇[取消]。
32=卸載映像文件...
33=鎖定
34=映像文件
35=掛載路徑
36=卷號
37=可寫
38=選擇掛載或解開的目標文件夾
39=解開WIM映像的目錄已存在文件，
40=從WIM映像中解開的文件會改寫原有的文件，
41=是否繼續將WIM映像解開并覆蓋原有的文件？
42=繼續解開選擇[是]，不解開選擇[否]。
43=選擇是否繼續解開WIM映像
44=目標文件夾中已存在文件！
45=WIM映像不能掛載到已存在文件的目錄中。
46=提示
47=刷新掛載列表...
48=已掛載的映卷數為:%u
49=卸載映像文件:%s ...
50=沒有可卸載的映像，映像已鎖定。
51=已用時間：
52=剩余時間：
53=文件數目：
54=解開映像
55=配置文件
56=卸載映像
57=掛載映像
58=刷新列表
59=選擇掛載或解開的WIM文件
60=選擇掛載或解開的目標文件夾
61=已掛載的映像信息
62=瀏覽
63=選項[2]
64=選項[1]
65=提示信息
66=卸載后刪掛載目錄
67=雙擊路徑打開目錄
68=雙擊文件卸載映像
69=雙擊表頭卸載全部
70=清除文件安全權限
71=任務前清空信息
72=可讀寫方式掛載
73=完成后打開目錄
74=不使用配置文件
75=映像卷號：
76=終止執行
77=可能無法掛載或卸載
78=目標映像是分割包文件，無法向分割包追加映像！
79=執行追加映像任務...
80=執行新建映像任務..
81=追加映像分卷...
82=建立映像文件...
83=添加啟動標志...
84=追加映像文件...
85=新建映像文件...
86=保存WIM文件
87=執行掛載卸載處理
88=選擇要制作成WIM映像的源目錄
89=選擇保存WIM映像的文件名
90=映像名稱：
91=映像說明：
92=顯示名稱：
93=顯示說明：
94=追加映像
95=新建映像
96=壓縮類型：
97=映像標志：
98=給該卷加上啟動標志
99=任務前清空提示信息
100=不使用捕獲配置文件
101=執行分割任務...
102=打開源頭文件...
103=分包文件如下：
104=分割映像文件...
105=執行導出任務...
106=打開目標文件...
107=導出映像分卷...
108=導出映像文件...
109=關閉目標文件...
110=關閉源頭文件...
111=打開分包文件錯誤！
112=映像導出任務...
113=已是分割包文件，不能再被分割！
114=導出合并
115=選擇要導出的WIM映像源文件或映像分包文件
116=選擇導出后的WIM目標文件名或合并后的文件
117=分割映像
118=選擇要分割的WIM映像文件名
119=選擇分割后的WIM目標文件名
120=目標WIM文件
121=分包大小設置錯誤！
122=選擇是否終止當前的操作？
123=WimTool正在執行導出映像操作，若終止當前的操作，
124=獲得的文件將是不完整的或損壞的，
125=建議你不要終止當前的操作！
126=要終止當前操作請選擇[是]，要繼續當前操作請選擇[否]。
127=未知
128=目錄數目
129=映像卷名：
130=任務選擇及目標設置
131=分包大小(M)：
132=請選擇一個擴展名為“.wim”的文件
133=Windows 映像格式
134=預測中...
135=默認
136=關閉
137=應用
138=保存
139=載入
140=提示
141=如果你不了解這配置文件，請不要修改它，使用默認設置，
142=如果你已修改了它又想使用默認的設置，請點[默認]按鈕。
143=[當前]
144=保存配置文件
145=目標文件已存在，
146=是否覆蓋已有的文件？
147=覆蓋原有的文件選擇[是]，否則選擇[否]。
148=選擇是否覆蓋已有的文件
149=圖標資源文件
150=打開文件
151=映像名稱
152=系統體系
153=系統版本
154=默認語言
155=展開大小
156=映像信息
157=修改映像信息
158=刪除映像分卷
159=WIM 映像文件
160=讀取映像信息...
161=屬于分割包文件[%u/%u]，不能修改信息！
162=請在列表中選擇卷號。
163=刪除映像分卷...
164=映像信息已經更新。
165=修改映像信息...
166=基本信息
167=文件路徑：
168=映卷總數：
169=分包文件：
170=啟動映卷：
171=[沒有設置]
172=映像大小：
173=目錄數目：
174=修改時間：
175=WimTool正在執行展開映像操作，若終止當前操作，
176=建議你不要終止當前的操作！
177=WimTool正在執行捕獲映像操作，若終止當前操作，
178=選擇目標掛載目錄
179=設置WimTool外殼擴展功能...
180=清除WimTool外殼擴展功能...
181=WimTool外殼擴展功能設置
182=可寫方式掛載
183=結束自動卸載
184=卸載保存更改
185=卸載刪除目錄
186=目標掛載目錄：
187=掛載完成執行：
188=卸載之前執行：
189=選項
190=卷名：
191=說明：
192=清除設置
193=應用設置
194=分割包文件，不能寫入圖標數據！
195=執行寫入擴展圖標任務
196=執行刪除擴展圖標任務
197=設置擴展圖標...
198=刪除圖標數據...
199=失敗，無法寫入圖標數據。
200=失敗，讀取不到圖標數據。
201=所請求的任務成功完成。
202=所請求的任務無法完成。
203=圖標資源
204=重建圖標緩存完成，建議重啟或注銷。
205=保存圖標文件
206=圖標文件(*.ICO)
207=選擇是否覆蓋原有的圖標文件
208=目標圖標文件已存在，
209=是否覆蓋原有的圖標文件？
210=用戶取消了操作。
211=圖標列表
212=圖標大小
213=重建圖標緩存
214=刪除擴展圖標
215=寫入擴展圖標
216=圖標資源文件
217=WIM映像及圖標資源
218=圖標大小及顯示效果
219=WIM中擴展圖標
220=無圖標
221=是否繼續執行你選擇的操作？
222=該目錄下的所有文件目錄將被刪除！
223=繼續執行選擇[是]，取消執行選擇[否]。
224=清理 WIM 自動掛載基礎目錄...
225=清理 WIM 臨時工作目錄...
226=WimTool - 注冊擴展功能
227=WimTool - 卸載擴展功能
228=載入默認的參數設置...
229=應用并保存當前的設置...
230=選擇WIM自動掛載基礎目錄
231=選擇WIM臨時工作目錄
232=除WIM映像已掛載的目錄外，
233=設置文件關聯
234=取消文件關聯
235=WimTool 目錄設置
236=清理
237=自動掛載基礎目錄：
238=WIM 臨時工作目錄：
239=保存應用設置
240=設置默認參數
241=卸載擴展功能
242=注冊擴展功能
243=參數設置
244=清空原有提示信息
245=操作完成打開目錄
246=正在解開映像...
247=正在捕獲映像...
248=取消
249=要更新選擇[是]，不更新選擇[否]。
250=注冊選項
251=卸載選項
252=資源管理器外殼圖標擴展
253=資源管理器外殼菜單擴展
254=資源管理器文件關聯設置
255=建立基礎掛載目錄失敗，
256=請將基礎掛載目錄設置到可寫分區。
257=建立臨時工作目錄失敗，
258=請將臨時工作目錄設置到可寫分區。
259=注冊外殼圖標擴展擴展...
260=卸載外殼圖標擴展擴展...
261=注冊外殼菜單擴展擴展...
262=卸載外殼菜單擴展擴展...
263=加載擴展功能的 DLL 發生錯誤！
264=注冊外殼執行擴展擴展...
265=卸載外殼執行擴展擴展...
266=建議重啟或注銷。
267=WimTool - WIM映像處理工具
268=復制 (Ctrl + C)
269=全選 (Ctrl + A)
270=老九作品，精品工具；版本所有，免費使用
271=選擇解開的目標文件夾
272=用 WimTool 處理(&S)...
273=添加到 WIM 映像(&A)...
274=用 WimTool 只讀卸載(&R)
275=用 WimTool 可寫卸載(&W)
276=添加到 WIM 映像(&A)...
277=添加到
278=解壓到
279=解壓到指定目錄(&A)...
280=用 WimTool 只讀掛載(&R)
281=用 WimTool 可寫掛載(&W)
282=用 WimTool 卸載所有(&T)
283=線程異常結束，殘留的目標文件是損壞的，關閉 WimTool 后方可刪除。
284=安全終止
285=強行終止
286=返回繼續
287=建議選擇[安全終止]，等待線程正常結束。
288=[強行終止]會立即結束，但可能造成程序崩潰。
289=要想繼續操行當前的操作，選擇[返回繼續]。
290=WimTool正在執行分割映像操作，若終止當前的操作，
291=WimTool - 查看映像詳細信息
292=映像詳細信息
293=給個名稱吧
294=正在導出映像...
295=代碼內置DLL，
296=查看映像信息
297=系統體系：
298=系統版本：
299=展開大小：
300=默認語言：
301=WimTool.EXE同目錄下的WimShExt.DLL不存在，或64位、32位不匹配。
302=圖像尺寸過大，不適合轉換成圖標！
303=檢測不到
304=WimTool與系統64位或32位不匹配！
305=目標WIM文件已存在，新制作的文件將會覆蓋原有的文件，
306=要確定新制作的文件選擇[是]，放棄操作選擇[否]。
307=窗口置頂
308=提取...
309=追加...
310=刪除...
311=打開...
312=屬性...
313=序號
314=文件目錄
315=類型名稱
316=文件大小
317=創建時間
318=修改時間
319=顯示映像擴展圖標
320=雙擊時打開該文件
321=卷映像
322=請選擇將文件提取到的目標目錄。
323=提取文件
324=請選擇一個要加入的目錄。
325=追加新卷
326=請選擇一個要追加的文件目錄。
327=追加文件目錄
328=刪除卷映像
329=確定要刪除WIM內的這個卷映像嗎？
330=確定刪除選擇[是]，放棄刪除選擇[否]。
331=刪除文件目錄
332=確定要刪除WIM內的這些文件目錄嗎？
333=正在追加建立新卷，
334=此過程不顯示進度，請稍候...
335=正在加入文件目錄
336=正在刪除文件目錄
337=正在刪除卷映像
338=WimTool正在執行提取文件操作，若終止當前操作，
339=創建時間：
340=優化映像重新壓縮
341=提取完成打開目錄
342=此處只能追加一個文件目錄，不能追加整個分區。
343=此處只能拖入目錄，不接受拖入文件。
344=WimTool 不是以管理員身份執行，功能會受到限制。
345=新建文件夾
346=上級目錄
347=文件夾
348=文件
349=改名...
350=優化...
351=優化映像
352=目標文件中已存在相同的映像卷。
353=執行轉換任務...
354=執行優化任務...
355=錯誤代碼：
356=分割包文件，不支持原文件直接優化轉換！
357=映像說明
358=選擇一個要被優化或轉換的源WIM映像文件名
359=選擇一個被優化或轉換后的目標WIM映像文件
360=WimTool正在執行優化轉換映像操作，若終止當前的操作，
361=優化轉換
362=映卷已存在也被導入
363=服務異常，
364=無法掛載或卸載
365=SYS與DLL版本不匹配，
366=列出被排除項目
367=WIMLIB兼熱備份支持
368=已排除:
369=開啟熱備份環境...
370=源目標不支持在線熱備份。
371=搜索
372=新建目標文件...
373=優化轉換映像...
374=正在優化映像...
375=設置映像信息...
376=所請求的操作...
377=文件數目
